Revit 2024 API
PartUtils.GetAssociatedPartMaker Method (Document, ElementId)
 Gets associated PartMaker for an element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static PartMaker GetAssociatedPartMaker(
	Document hostDocument,
	ElementId elementId
)
Visual Basic
Public Shared Function GetAssociatedPartMaker ( _
	hostDocument As Document, _
	elementId As ElementId _
) As PartMaker
Visual C++
public:
static PartMaker^ GetAssociatedPartMaker(
	Document^ hostDocument,
	ElementId^ elementId
)
Parameters
hostDocument
Type: Autodesk.Revit.DB.Document
 The document
elementId
Type: Autodesk.Revit.DB.ElementId
 The id for the element to be checked for associated Parts
Return Value
 The PartMaker element that is making Parts for this element. null if there is no associated PartMaker.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
GetAssociatedPartMaker Overload
Autodesk.Revit.DB Namespace